In [19]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
kakao = Series([100, 200])
print(kakao)

0    100
1    200
dtype: int64

In [3]:
raw_data = {'col0' : [1, 2, 3, 4],
            'col1' : [10, 20, 30, 40],
            'col2' : [100, 200, 300, 400]}
data = DataFrame(raw_data)
print(data)

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [4]:
date = ['16.02.29', '16.02.26', '16.02.23', '16.02.27']
data1 = DataFrame(raw_data, index=date)
print(data1)

          col0  col1  col2
16.02.29     1    10   100
16.02.26     2    20   200
16.02.23     3    30   300
16.02.27     4    40   400

In [5]:
day_data1 = data1.loc['16.02.29']
print(day_data1)

col0      1
col1     10
col2    100
Name: 16.02.29, dtype: int64

In [6]:
col1 = data1['col1']
print(col1)

16.02.29    10
16.02.26    20
16.02.23    30
16.02.27    40
Name: col1, dtype: int64

In [7]:
print(data1.columns)
print(data1.index)

Index(['col0', 'col1', 'col2'], dtype='object')
Index(['16.02.29', '16.02.26', '16.02.23', '16.02.27'], dtype='object')

In [8]:
data1

          col0  col1  col2
16.02.29     1    10   100
16.02.26     2    20   200
16.02.23     3    30   300
16.02.27     4    40   400

In [9]:
data1.transpose()

      16.02.29  16.02.26  16.02.23  16.02.27
col0         1         2         3         4
col1        10        20        30        40
col2       100       200       300       400

In [10]:
data1.columns = ['A', 'B', 'C']
data1

          A   B    C
16.02.29  1  10  100
16.02.26  2  20  200
16.02.23  3  30  300
16.02.27  4  40  400

In [11]:
[[4, 9]] * 3

[[4, 9], [4, 9], [4, 9]]

In [12]:
data2 = data1.copy()
data2.index = [0, 1, 2, 3]
data2

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [13]:
(data2 > 20).any()

A    False
B     True
C     True
dtype: bool

In [14]:
(data2 > 20).any

<bound method DataFrame.any of        A      B     C
0  False  False  True
1  False  False  True
2  False   True  True
3  False   True  True>

In [15]:
data2[1:3].count()

A    2
B    2
C    2
dtype: int64

In [16]:
len(data2)

4

In [28]:
pd.cut(np.array([1.005, 7, 5, 4, 6, 3,]), 3)

[(0.999, 3.003], (5.002, 7.0], (3.003, 5.002], (3.003, 5.002], (5.002, 7.0], (0.999, 3.003]]
Categories (3, interval[float64]): [(0.999, 3.003] < (3.003, 5.002] < (5.002, 7.0]]

In [31]:
s = pd.Series(np.array([2, 4, 6, 8, 10]), index=['a', 'b', 'c', 'd', 'e'])
pd.cut(s, [0, 2, 4, 6, 8, 10], labels=False, retbins=True, right=False)

(a    1.0
 b    2.0
 c    3.0
 d    4.0
 e    NaN
 dtype: float64,
 array([ 0,  2,  4,  6,  8, 10]))

In [32]:
pd.cut(s, [0, 2, 4, 6, 8, 10], labels=False, retbins=True, right=True)

(a    0
 b    1
 c    2
 d    3
 e    4
 dtype: int64,
 array([ 0,  2,  4,  6,  8, 10]))

In [40]:
tsdf = pd.DataFrame(np.random.randn(1000, 3), columns=['A', 'B', 'C'], index=pd.date_range('1/1/2000', periods=1000))
tsdf

                   A         B         C
2000-01-01 -0.281402  1.948706  0.971768
2000-01-02  1.150758  0.618557  0.879255
2000-01-03  0.691312 -0.161959 -0.417041
2000-01-04  0.558976  0.147726  0.300719
2000-01-05  0.915775 -1.210738  0.207009
...              ...       ...       ...
2002-09-22 -1.202982  1.643844  0.468783
2002-09-23 -1.592125  0.306276  0.437795
2002-09-24  1.529939  0.612410 -0.660423
2002-09-25 -0.073225 -1.689650 -1.870715
2002-09-26  0.251511  0.298632 -0.276227

[1000 rows x 3 columns]

In [41]:
tsdf.apply(lambda x: x.idxmax())

A   2000-06-02
B   2000-09-21
C   2001-02-21
dtype: datetime64[ns]

In [37]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [35]:
df.apply(lambda x: [1, 2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [38]:
df.apply(lambda x: [1, 2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [39]:
df

   A  B
0  4  9
1  4  9
2  4  9